export enum Gender {
  MALE = "MALE",
  FEMALE = "FEMALE",
}

export enum Department {
  SW융합대학_소프트웨어학과 = "SW융합대학_소프트웨어학과",
  SW융합대학_컴퓨터공학과 = "SW융합대학_컴퓨터공학과",
  SW융합대학_사이버보안학과 = "SW융합대학_사이버보안학과",
  SW융합대학_인공지능학과 = "SW융합대학_인공지능학과",
  SW융합대학_통계데이터사이언스학과 = "SW융합대학_통계데이터사이언스학과",
  SW융합대학_SW융합학부 = "SW융합대학_SW융합학부",
  프리무스국제대학_모바일시스템공학과 = "프리무스국제대학_모바일시스템공학과",
  퇴계혁신칼리지_SW융합계열광역 = "퇴계혁신칼리지_SW융합계열광역",
  퇴계혁신칼리지_광역 = "퇴계혁신칼리지_광역",
  퇴계혁신칼리지_공학계열광역 = "퇴계혁신칼리지_공학계열광역",
  퇴계혁신칼리지_인문계열광역 = "퇴계혁신칼리지_인문계열광역",
  퇴계혁신칼리지_사회계열광역 = "퇴계혁신칼리지_사회계열광역",
  공과대학_전자전기공학과 = "공과대학_전자전기공학과",
  공과대학_융합반도체공학과 = "공과대학_융합반도체공학과",
  공과대학_고분자시스템공학부_고분자공학전공 = "공과대학_고분자시스템공학부_고분자공학전공",
  공과대학_고분자시스템공학부_파이버융합소재공학전공 = "공과대학_고분자시스템공학부_파이버융합소재공학전공",
  공과대학_토목환경공학과 = "공과대학_토목환경공학과",
  공과대학_기계공학과 = "공과대학_기계공학과",
  공과대학_화학공학과 = "공과대학_화학공학과",
  공과대학_건축학부_건축학전공_5년제 = "공과대학_건축학부_건축학전공_5년제",
  공과대학_건축학부_건축공학전공 = "공과대학_건축학부_건축공학전공",
  문과대학_국어국문학과 = "문과대학_국어국문학과",
  문과대학_사학과 = "문과대학_사학과",
  문과대학_철학과 = "문과대학_철학과",
  문과대학_영미인문학과 = "문과대학_영미인문학과",
  법과대학_법학과 = "법과대학_법학과",
  사회과학대학_정치외교학과 = "사회과학대학_정치외교학과",
  사회과학대학_행정학과 = "사회과학대학_행정학과",
  사회과학대학_도시계획부동산학부 = "사회과학대학_도시계획부동산학부",
  사회과학대학_미디어커뮤니케이션학부 = "사회과학대학_미디어커뮤니케이션학부",
  사회과학대학_상담학과 = "사회과학대학_상담학과",
  경영경제대학_무역학과 = "경영경제대학_무역학과",
  경영경제대학_경영학부_경영학전공 = "경영경제대학_경영학부_경영학전공",
  경영경제대학_경영학부_회계학전공 = "경영경제대학_경영학부_회계학전공",
  경영경제대학_글로벌경영학과 = "경영경제대학_글로벌경영학과",
  경영경제대학_산업경영학과_야 = "경영경제대학_산업경영학과_야",
  경영경제대학_경제학과 = "경영경제대학_경제학과",
  사범대학_한문교육과 = "사범대학_한문교육과",
  사범대학_특수교육과 = "사범대학_특수교육과",
  사범대학_수학교육과 = "사범대학_수학교육과",
  사범대학_과학교육과 = "사범대학_과학교육과",
  사범대학_체육교육과 = "사범대학_체육교육과",

  프리무스국제대학_국제경영학과 = "프리무스국제대학_국제경영학과",
  프리무스국제대학_바이오소재융합공학과 = "프리무스국제대학_바이오소재융합공학과",
  프리무스국제대학_한국학과 = "프리무스국제대학_한국학과",
  프리무스국제대학_연기영상예술학과 = "프리무스국제대학_연기영상예술학과",
  프리무스국제대학_글로벌기초교육학부 = "프리무스국제대학_글로벌기초교육학부",

  음악예술대학_공연영화학부_영화전공 = "음악예술대학_공연영화학부_영화전공",
  음악예술대학_공연영화학부_연극전공 = "음악예술대학_공연영화학부_연극전공",
  음악예술대학_공연영화학부_뮤지컬전공 = "음악예술대학_공연영화학부_뮤지컬전공",
  음악예술대학_도예과 = "음악예술대학_도예과",
  음악예술대학_디자인학부_커뮤니케이션디자인전공 = "음악예술대학_디자인학부_커뮤니케이션디자인전공",
  음악예술대학_디자인학부_패션산업디자인전공 = "음악예술대학_디자인학부_패션산업디자인전공",
  음악예술대학_무용과 = "음악예술대학_무용과",
  음악예술대학_음악학부_피아노전공 = "음악예술대학_음악학부_피아노전공",
  음악예술대학_음악학부_관현악전공 = "음악예술대학_음악학부_관현악전공",
  음악예술대학_음악학부_성악전공 = "음악예술대학_음악학부_성악전공",
  음악예술대학_음악학부_작곡전공 = "음악예술대학_음악학부_작곡전공",
  음악예술대학_음악학부_국악전공 = "음악예술대학_음악학부_국악전공",
  율곡혁신칼리지_광역 = "율곡혁신칼리지_광역",
  율곡혁신칼리지_인문사회계열광역 = "율곡혁신칼리지_인문사회계열광역",
  율곡혁신칼리지_자연공학계열광역 = "율곡혁신칼리지_자연공학계열광역",
  외국어대학_아시아중동학부_중국학전공 = "외국어대학_아시아중동학부_중국학전공",
  외국어대학_아시아중동학부_일본학전공 = "외국어대학_아시아중동학부_일본학전공",
  외국어대학_아시아중동학부_몽골학전공 = "외국어대학_아시아중동학부_몽골학전공",
  외국어대학_아시아중동학부_중동학전공 = "외국어대학_아시아중동학부_중동학전공",
  외국어대학_아시아중동학부_베트남학전공 = "외국어대학_아시아중동학부_베트남학전공",
  외국어대학_유럽중남미학부_독일학전공 = "외국어대학_유럽중남미학부_독일학전공",
  외국어대학_유럽중남미학부_프랑스학전공 = "외국어대학_유럽중남미학부_프랑스학전공",
  외국어대학_유럽중남미학부_스페인중남미학전공 = "외국어대학_유럽중남미학부_스페인중남미학전공",
  외국어대학_유럽중남미학부_러시아학전공 = "외국어대학_유럽중남미학부_러시아학전공",
  외국어대학_유럽중남미학부_포르투갈브라질학전공 = "외국어대학_유럽중남미학부_포르투갈브라질학전공",
  외국어대학_영어과 = "외국어대학_영어과",
  외국어대학_글로벌한국어과 = "외국어대학_글로벌한국어과",
  공공인재대학_공공정책학과 = "공공인재대학_공공정책학과",
  공공인재대학_공공정책학과_야 = "공공인재대학_공공정책학과_야",
  공공인재대학_해병대군사학과 = "공공인재대학_해병대군사학과",
  공공인재대학_식품자원경제학과 = "공공인재대학_식품자원경제학과",
  공공인재대학_사회복지학과 = "공공인재대학_사회복지학과",
  보건과학대학_보건행정학과 = "보건과학대학_보건행정학과",
  과학기술대학_수학과 = "과학기술대학_수학과",
  과학기술대학_물리학과 = "과학기술대학_물리학과",
  과학기술대학_화학과 = "과학기술대학_화학과",
  과학기술대학_식품영양학과 = "과학기술대학_식품영양학과",
  과학기술대학_신소재공학과 = "과학기술대학_신소재공학과",
  과학기술대학_에너지공학과 = "과학기술대학_에너지공학과",
  과학기술대학_경영공학과 = "과학기술대학_경영공학과",
  과학기술대학_제약공학과 = "과학기술대학_제약공학과",
  간호대학_간호학과 = "간호대학_간호학과",
  바이오융합대학_생명자원학부_식량생명공학전공 = "바이오융합대학_생명자원학부_식량생명공학전공",
  바이오융합대학_생명자원학부_동물생명공학전공 = "바이오융합대학_생명자원학부_동물생명공학전공",
  바이오융합대학_생명자원학부_환경원예학전공 = "바이오융합대학_생명자원학부_환경원예학전공",
  바이오융합대학_생명자원학부_녹지조경학전공 = "바이오융합대학_생명자원학부_녹지조경학전공",
  바이오융합대학_의생명과학부_의생명시스템학전공 = "바이오융합대학_의생명과학부_의생명시스템학전공",
  바이오융합대학_의생명과학부_생명과학전공 = "바이오융합대학_의생명과학부_생명과학전공",
  바이오융합대학_의생명과학부_미생물학전공 = "바이오융합대학_의생명과학부_미생물학전공",
  바이오융합대학_식품공학과 = "바이오융합대학_식품공학과",
  바이오융합대학_코스메디컬소재학과 = "바이오융합대학_코스메디컬소재학과",
  보건과학대학_임상병리학과 = "보건과학대학_임상병리학과",
  보건과학대학_물리치료학과 = "보건과학대학_물리치료학과",
  보건과학대학_치위생학과 = "보건과학대학_치위생학과",
  보건과학대학_심리치료학과 = "보건과학대학_심리치료학과",
  예술대학_미술학부_공예금속섬유전공 = "예술대학_미술학부_공예금속섬유전공",
  예술대학_미술학부_동양화전공 = "예술대학_미술학부_동양화전공",
  예술대학_미술학부_서양화전공 = "예술대학_미술학부_서양화전공",
  예술대학_미술학부_조소전공 = "예술대학_미술학부_조소전공",
  예술대학_문예창작과 = "예술대학_문예창작과",
  예술대학_뉴뮤직학부 = "예술대학_뉴뮤직학부",
  스포츠과학대학_생활체육학과 = "스포츠과학대학_생활체육학과",
  스포츠과학대학_스포츠경영학과 = "스포츠과학대학_스포츠경영학과",
  스포츠과학대학_국제스포츠학부_국제스포츠전공 = "스포츠과학대학_국제스포츠학부_국제스포츠전공",
  스포츠과학대학_국제스포츠학부_태권도전공 = "스포츠과학대학_국제스포츠학부_태권도전공",
  스포츠과학대학_국제스포츠학부_운동처방재활전공 = "스포츠과학대학_국제스포츠학부_운동처방재활전공",
  스포츠과학대학_국제스포츠학부_골프전공 = "스포츠과학대학_국제스포츠학부_골프전공",
  의과대학_의예과 = "의과대학_의예과",
  치과대학_치의예과 = "치과대학_치의예과",
  약학대학_약학과 = "약학대학_약학과",
}

export enum AcademicStatus {
  ENROLLED = "ENROLLED",
  LEAVE_OF_ABSENCE = "LEAVE_OF_ABSENCE",
  GRADUATED = "GRADUATED",
}

export enum Grade {
  ONE = "ONE",
  TWO = "TWO",
  THREE = "THREE",
  FOUR = "FOUR",
  FIVE = "FIVE",
  SIX = "SIX",
}

export enum Semester {
  FIRST = "FIRST",
  SECOND = "SECOND",
}

export enum Role {
  ROLE_GUEST = "ROLE_GUEST",
  ROLE_USER = "ROLE_USER",
  ROLE_ADMIN = "ROLE_ADMIN",
}

export interface Member {
  birth_date: string;
  gender: Gender;
  student_id: string;
  phone_number: string;
  department: Department;
  academic_status: AcademicStatus;
  grade: Grade;
  semester: Semester;
}

export interface GetMemberResponse extends Member {
  // GET /member
  id: number;
  email: string;
  name: string;
}

export interface CreateMemberRequest extends Member {
  // POST /member
}
